{
	"tellme": {
		"title": "Cigna TellMe",
        "image": "/assets/images/floorcast-logo.jpg",
		"description": "During my final semester at the University of Michigan, I worked on a responsive web application that tracked the student traffic levels in the undergraduate library in real time. The school provided my team with the metrics we used for the application. This data showed how many devices were connected to each router in the library and it was delivered via email every 5 minutes. A java application was used to populate the database with the data from these emails.<br>My role in the project was to develop the frontend and build the web framework. I used Python Flask to run the application and pull the data from the SQL database. The data was converted to a percentage based on the maximum capacity of each area of the library. Once the framework was built, I mocked up the front end using Photoshop and converted it to HTML, CSS, and JavaScript once we finalized the look and feel.<br>When the first version of the application was launched, my team started working on marketing efforts to encourage students to start using Floorcast. We promoted the app in the library using flyers and table tents. We also launched a social media campaign involving Facebook, Instagram, and Twitter where our posts could be seen and shared. The project was supported by the University of Michigan Information & Technology Services, as well as the Central Student Government until it was discontinued in 2016.",
        "company": "Cigna",
		"date": "6/20/2017",
		"skills": "HTML, CSS, HP Teamsite",
		"website": "http://www.tellme.cigna.com",
        "thumbnail":"/assets/images/portfolio/floorcast/floorcast-thumbnail.jpg" 
	},
    "floorcast": {
		"title": "FloorCast",
        "image": "/assets/images/floorcast-logo.jpg",
		"description": "During my final semester at the University of Michigan, I worked on a responsive web application that tracked the student traffic levels in the undergraduate library in real time. The school provided my team with the metrics we used for the application. This data showed how many devices were connected to each router in the library and it was delivered via email every 5 minutes. A java application was used to populate the database with the data from these emails.<br>My role in the project was to develop the frontend and build the web framework. I used Python Flask to run the application and pull the data from the SQL database. The data was converted to a percentage based on the maximum capacity of each area of the library. Once the framework was built, I mocked up the front end using Photoshop and converted it to HTML, CSS, and JavaScript once we finalized the look and feel.<br>When the first version of the application was launched, my team started working on marketing efforts to encourage students to start using Floorcast. We promoted the app in the library using flyers and table tents. We also launched a social media campaign involving Facebook, Instagram, and Twitter where our posts could be seen and shared. The project was supported by the University of Michigan Information & Technology Services, as well as the Central Student Government until it was discontinued in 2016.",
        "company": "personal",
		"date": "9/30/2014",
		"skills": "Flask, SQL, HTML, CSS, JS",
		"website": "",
        "thumbnail":"/assets/images/portfolio/floorcast/floorcast-thumbnail.jpg" 
	},
	"cchs": {
		"title": "Crawford County Historical Society Website",
        "image": "/assets/images/portfolio/cchs/cchs-exhibits.jpg",
		"description": "As part of the effort to increase museum traffic and raise money for the Crawford County Historical Society, I offered to revamp the society's website. The goal was to improve the digital presence and attract attention to the many historical exhibits and displays. <br>I used AxureRP to mock up the site and get feedback from the society’s board members before starting the development. The website is an angular application built with HTML5/Bootstrap3 and a document-oriented database. Lastly, the website uses PHP mailer for contact and newsletter submissions.<After the site went into production, I worked on analytics and search engine optimization. The analytics are set to track page views as well as events. I provide the board with key metrics so they know what pages are doing well and what can be improved.<br>For SEO, I created a Google Business and Google Webmaster Account for the site to monitor interactions across the web. I also worked with the board to improve the content by making it more concise and adding important keywords. Lastly, I optimized the site by decreasing page load time. Site traffic has steadily increased since the launch and the number of museum visitors is on the rise.",
        "company": "CCHS",
		"date": " 1/15/2017",
		"skills": "AngularJS, HTML, CSS, PHP, SEO, JSON",
		"website": "<a href=\"http://www.crawfordcountyhistoricalsociety.com\" target=\"_blank\">crawfordcountyhistoricalsociety.com</a>",
        "thumbnail":"/assets/images/portfolio/cchs/cchs-thumbnail.jpg" 
	}, 
    "ifp": {
		"title": "Cigna Individual & Family Plans",
        "image": "/assets/images/portfolio/ifp/ifp-landing-full.jpg",
		"description": "Every year, Cigna holds its open enrollment period for individual and family plans between the months of October and January. As part of the preparation for this period, the website and plan details must be updated and ready for launch on Day 1. <br>For the 2016 release, the most complex piece of the project was the plan finder application. I worked with my team to move the backend framework from Java to AngularJS. As part of this effort, I created a Python script to pull multiple excel sheets of data into one XML file. This allowed us to automate the effort versus completing it by hand as has been done in the past.<br>In addition to the plan finder, I also created a microsite by translating a UI spec to code, created a script to generate TeamSite components, and worked on various new pages and content updates.",
        "company": "Cigna",
		"date": "10/1/2016",
		"skills": "HP Teamsite, Python, HTML, CSS, JS",
		"website": "<a href=\"http://www.cigna.com/individuals-families\" target=\"_blank\">www.cigna.com/individuals-families</a>",
        "thumbnail":"/assets/images/portfolio/ifp/ifp-thumbnail.jpg" 
	}, 
    "medicare": {
		"title": "Cigna Medicare 2017",
        "image": "/assets/images/portfolio/medicare/medicare-plans.jpg",
		"description": "Every year, the Cigna HealthSpring-Medicare website needs to be updated with the annual plans and content in order to provide customers with accurate information and stay compliant with the Centers for Medicare and Medicaid Services. For this project, we worked with our HealthSpring partners in Nashville to prepare the website for launch on October 1, 2016. <br>In previous years, the plan data was managed on several spreadsheets, which was tedious and vulnerable to error. To expedite this process and ensure accuracy, I created a python script that took the data from various data spreadsheets and converted it into JSON, which was then used by the plan finder application.<br>I also provided content updates and defect correction leading up to the release and continued to support the site after release.",
        "company": "Cigna",
		"date": "11/1/2016",
		"skills": "HP Teamsite, Python, JSON",
		"website": "<a href=\"http://www.cigna.com/medicare\" target=\"_blank\">www.cigna.com/medicare</a>",
        "thumbnail":"/assets/images/portfolio/medicare/medicare-thumbnail.jpg" 
	},
    "hongkong": {
		"title": "Cigna Hong Kong",
        "image": "/assets/images/portfolio/hongkong/hk-landing-cn.jpg",
		"description": "One of Cigna’s biggest IT projects in Q4 2016 was to migrate the Cigna Hong Kong site onto the HP Teamsite Content Manager. With significant collaboration between the U.S. and Hong Kong teams, we revamped the Hong Kong site with a brand new UI/UX experience and added new pages.<br>My primary role on this project was to update the content and the user interface to meet the business requirements, which continuously changed during the development process. I also worked on defect correction for the site to address the issues identified by our Quality Assurance team and the Business team in Hong Kong.",
        "company": "Cigna",
		"date": "12/16/2016",
		"skills": "HTML, CSS, XSL, HP Teamsite",
		"website": "<a href=\"http://www.cigna.com.hk\" target=\"_blank\">cigna.com.hk</a>",
        "thumbnail":"/assets/images/portfolio/hongkong/hongkong-thumbnail.jpg" 
	},
    "dxs": {
		"title": "Cigna Digital Experience Standards",
        "image": "/assets/images/portfolio/dxs/dxs-thumbnail.png",
		"description": "In October 2016, a project came from the Global Vice President of Digital Marketing. She wanted a more 'accessible, customer-centric, insights driven end-to-end digital experience for tens of millions of users'. As a result, the standards became our number one priority. <br> Working with the Digital Marketing team and an external agency, I took on the role as lead developer for this project. We recieved the code from the agency, and it was my task to turn that code into Teamsite components and pages.<br>Once the site was launched, I worked on the User Experience Team to further improve the content and UI, as well as keep the stardards accurate and up-to-date.",
        "company": "Cigna",
		"date": "1/19/2017",
		"skills": "HTML, CSS, XSL, HP Teamsite",
		"website": "",
        "thumbnail":"/assets/images/portfolio/dxs/dxs-thumbnail.jpg" 
	}
    
}